In [1]:
import numpy as np
import pandas as pd

In [5]:
a = pd.Series()
print(a)

Series([], dtype: object)

In [10]:
a = pd.DataFrame()
b = a.empty
b

True

In [11]:
a = {'A': [1, 2, 3], 'B': [4, 5, 6]}
b = pd.DataFrame(a)
c = b.reindex(['aa','bb','cc'])
c

     A   B
aa NaN NaN
bb NaN NaN
cc NaN NaN

In [12]:
c = np.arange(12).reshape(4,3)
d = pd.DataFrame(c,columns=['a','b','c'])
d

   a   b   c
0  0   1   2
1  3   4   5
2  6   7   8
3  9  10  11

In [16]:
df = pd.DataFrame({
    'A': [1, 2, 3],
    'B': [4, 5, 6]})
df.set_index('B',inplace=True)
df

   A
B
4  1
5  2
6  3

In [17]:
df['XX']=[55,66,77]

In [18]:
df

   A  XX
B
4  1  55
5  2  66
6  3  77

In [19]:
df = pd.DataFrame({
    'A': [1, 2, 3],
    'B': [4, 5, 6]})
df.rename(columns={'A':'XX','B':'ZZ'},inplace=True)
df

   XX  ZZ
0   1   4
1   2   5
2   3   6

In [23]:
df.rename(index={0:11,1:22,2:33},inplace=True)
df

    XX  ZZ
11   1   4
22   2   5
33   3   6

In [26]:
df.rename(index={0:'111',1:'222',2:'333'},inplace=True)
df

    XX  ZZ
11   1   4
22   2   5
33   3   6

In [27]:
c = df['XX'].tolist()
c

[1, 2, 3]

In [28]:
d = df.values.flatten().tolist()
d

[1, 4, 2, 5, 3, 6]

In [32]:
df = pd.read_csv('bank-additional-full.csv',sep=';')
df.head(3)

,age,job,marital,education,default,housing,loan,contact,month,day_of_week,...,campaign,pdays,previous,poutcome,emp.var.rate,cons.price.idx,cons.conf.idx,euribor3m,nr.employed,y
0,56,housemaid,married,basic.4y,no,no,no,telephone,may,mon,...,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no
1,57,services,married,high.school,unknown,no,no,telephone,may,mon,...,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no
2,37,services,married,high.school,no,yes,no,telephone,may,mon,...,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no

In [37]:
df.groupby('job')['education'].sum()

job
admin.           basic.6yprofessional.coursehigh.schoolunknownu...
blue-collar      unknownunknownhigh.schoolbasic.6ybasic.6ybasic...
entrepreneur     high.schooluniversity.degreeuniversity.degreeu...
housemaid        basic.4ybasic.4ybasic.4ybasic.6ybasic.4yuniver...
management       basic.9ybasic.4yuniversity.degreeuniversity.de...
retired          basic.9yhigh.schooluniversity.degreebasic.4yhi...
self-employed    basic.9yuniversity.degreeuniversity.degreebasi...
services         high.schoolhigh.schoolhigh.schoolbasic.9yhigh....
student          university.degreeuniversity.degreeuniversity.d...
technician       professional.coursehigh.schooluniversity.degre...
unemployed       high.schoolprofessional.coursebasic.9ybasic.4y...
unknown          university.degreebasic.4yunknownunknownhigh.sc...
Name: education, dtype: object

In [49]:
df['age']=df['age'].apply(lambda x: x + 10)

In [50]:
df.head(5)

,age,job,marital,education,default,housing,loan,contact,month,day_of_week,...,campaign,pdays,previous,poutcome,emp.var.rate,cons.price.idx,cons.conf.idx,euribor3m,nr.employed,y
0,106,True,married,basic.4y,no,no,no,telephone,may,mon,...,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no
1,107,True,married,high.school,unknown,no,no,telephone,may,mon,...,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no
2,87,True,married,high.school,no,yes,no,telephone,may,mon,...,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no
3,90,True,married,basic.6y,no,no,no,telephone,may,mon,...,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no
4,106,True,married,high.school,no,no,yes,telephone,may,mon,...,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no

In [52]:
df.groupby('marital').get_group('married')

,age,job,marital,education,default,housing,loan,contact,month,day_of_week,...,campaign,pdays,previous,poutcome,emp.var.rate,cons.price.idx,cons.conf.idx,euribor3m,nr.employed,y
0,106,True,married,basic.4y,no,no,no,telephone,may,mon,...,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no
1,107,True,married,high.school,unknown,no,no,telephone,may,mon,...,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no
2,87,True,married,high.school,no,yes,no,telephone,may,mon,...,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no
3,90,True,married,basic.6y,no,no,no,telephone,may,mon,...,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no
4,106,True,married,high.school,no,no,yes,telephone,may,mon,...,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
41183,123,True,married,professional.course,no,yes,no,cellular,nov,fri,...,1,999,0,nonexistent,-1.1,94.767,-50.8,1.028,4963.6,yes
41184,96,True,married,professional.course,no,no,no,cellular,nov,fri,...,1,999,0,nonexistent,-1.1,94.767,-50.8,1.028,4963.6,no
41185,106,True,married,university.degree,no,yes,no,cellular,nov,fri,...,2,999,0,nonexistent,-1.1,94.767,-50.8,1.028,4963.6,no
41186,94,True,married,professional.course,no,no,no,cellular,nov,fri,...,1,999,0,nonexistent,-1.1,94.767,-50.8,1.028,4963.6,yes
41187,124,True,married,professional.course,no,yes,no,cellular,nov,fri,...,3,999,1,failure,-1.1,94.767,-50.8,1.028,4963.6,no

In [55]:
df['AAA']=99

In [57]:
df.head(5)

,age,job,marital,education,default,housing,loan,contact,month,day_of_week,...,pdays,previous,poutcome,emp.var.rate,cons.price.idx,cons.conf.idx,euribor3m,nr.employed,y,AAA
0,106,True,married,basic.4y,no,no,no,telephone,may,mon,...,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no,99
1,107,True,married,high.school,unknown,no,no,telephone,may,mon,...,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no,99
2,87,True,married,high.school,no,yes,no,telephone,may,mon,...,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no,99
3,90,True,married,basic.6y,no,no,no,telephone,may,mon,...,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no,99
4,106,True,married,high.school,no,no,yes,telephone,may,mon,...,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no,99

In [ ]:
df.insert(0, 'MAYUR',10) #columne at 0 index with value 10

In [61]:
df

,MAYUR,age,job,marital,education,default,housing,loan,contact,month,...,pdays,previous,poutcome,emp.var.rate,cons.price.idx,cons.conf.idx,euribor3m,nr.employed,y,AAA
0,10,106,True,married,basic.4y,no,no,no,telephone,may,...,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no,99
1,10,107,True,married,high.school,unknown,no,no,telephone,may,...,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no,99
2,10,87,True,married,high.school,no,yes,no,telephone,may,...,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no,99
3,10,90,True,married,basic.6y,no,no,no,telephone,may,...,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no,99
4,10,106,True,married,high.school,no,no,yes,telephone,may,...,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no,99
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
41183,10,123,True,married,professional.course,no,yes,no,cellular,nov,...,999,0,nonexistent,-1.1,94.767,-50.8,1.028,4963.6,yes,99
41184,10,96,True,married,professional.course,no,no,no,cellular,nov,...,999,0,nonexistent,-1.1,94.767,-50.8,1.028,4963.6,no,99
41185,10,106,True,married,university.degree,no,yes,no,cellular,nov,...,999,0,nonexistent,-1.1,94.767,-50.8,1.028,4963.6,no,99
41186,10,94,True,married,professional.course,no,no,no,cellular,nov,...,999,0,nonexistent,-1.1,94.767,-50.8,1.028,4963.6,yes,99
41187,10,124,True,married,professional.course,no,yes,no,cellular,nov,...,999,1,failure,-1.1,94.767,-50.8,1.028,4963.6,no,99

In [62]:
df.columns

Index(['MAYUR', 'age', 'job', 'marital', 'education', 'default', 'housing',
       'loan', 'contact', 'month', 'day_of_week', 'duration', 'campaign',
       'pdays', 'previous', 'poutcome', 'emp.var.rate', 'cons.price.idx',
       'cons.conf.idx', 'euribor3m', 'nr.employed', 'y', 'AAA'],
      dtype='object')

In [64]:
df.drop(['MAYUR','AAA'],axis=1,inplace=True)

In [65]:
df.columns

Index(['age', 'job', 'marital', 'education', 'default', 'housing', 'loan',
       'contact', 'month', 'day_of_week', 'duration', 'campaign', 'pdays',
       'previous', 'poutcome', 'emp.var.rate', 'cons.price.idx',
       'cons.conf.idx', 'euribor3m', 'nr.employed', 'y'],
      dtype='object')

In [67]:
aa = df['age'].quantile(0.25)

In [68]:
aa

82.0

In [69]:
df['age'].quantile(0.50)

88.0

In [70]:
df['age'].quantile(0.75)

97.0

In [71]:
df['age'].max()

148

In [72]:
df['age'].min()

67

In [75]:
df.sort_values(by=df.columns.tolist(),ascending=False)

,age,job,marital,education,default,housing,loan,contact,month,day_of_week,...,campaign,pdays,previous,poutcome,emp.var.rate,cons.price.idx,cons.conf.idx,euribor3m,nr.employed,y
38452,148,True,married,basic.4y,unknown,yes,no,cellular,oct,fri,...,1,2,2,success,-3.4,92.431,-26.9,0.730,5017.5,yes
38455,148,True,married,basic.4y,unknown,yes,no,cellular,oct,fri,...,2,999,0,nonexistent,-3.4,92.431,-26.9,0.730,5017.5,yes
27826,145,True,divorced,basic.6y,no,no,no,cellular,mar,thu,...,1,999,0,nonexistent,-1.8,92.843,-50.0,1.650,5099.1,no
38921,144,True,married,basic.9y,no,no,no,cellular,nov,wed,...,1,999,1,failure,-3.4,92.649,-30.1,0.716,5017.5,no
39655,142,True,married,unknown,no,yes,no,cellular,may,thu,...,1,6,2,success,-1.8,93.876,-40.0,0.683,5008.7,no
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
37140,67,True,single,unknown,no,yes,no,cellular,aug,wed,...,3,4,2,success,-2.9,92.201,-31.4,0.884,5076.2,no
38274,67,True,single,unknown,no,no,yes,cellular,oct,tue,...,1,2,2,success,-3.4,92.431,-26.9,0.742,5017.5,yes
37539,67,True,single,basic.9y,no,yes,no,cellular,aug,fri,...,2,999,2,failure,-2.9,92.201,-31.4,0.869,5076.2,no
37558,67,True,single,basic.9y,no,yes,no,cellular,aug,fri,...,3,4,2,success,-2.9,92.201,-31.4,0.869,5076.2,no
37579,67,True,single,basic.9y,no,unknown,unknown,cellular,aug,fri,...,2,999,1,failure,-2.9,92.201,-31.4,0.869,5076.2,yes

In [76]:
df.sort_values(by=df.columns.tolist(),ascending=False)

,age,job,marital,education,default,housing,loan,contact,month,day_of_week,...,campaign,pdays,previous,poutcome,emp.var.rate,cons.price.idx,cons.conf.idx,euribor3m,nr.employed,y
38452,148,True,married,basic.4y,unknown,yes,no,cellular,oct,fri,...,1,2,2,success,-3.4,92.431,-26.9,0.730,5017.5,yes
38455,148,True,married,basic.4y,unknown,yes,no,cellular,oct,fri,...,2,999,0,nonexistent,-3.4,92.431,-26.9,0.730,5017.5,yes
27826,145,True,divorced,basic.6y,no,no,no,cellular,mar,thu,...,1,999,0,nonexistent,-1.8,92.843,-50.0,1.650,5099.1,no
38921,144,True,married,basic.9y,no,no,no,cellular,nov,wed,...,1,999,1,failure,-3.4,92.649,-30.1,0.716,5017.5,no
39655,142,True,married,unknown,no,yes,no,cellular,may,thu,...,1,6,2,success,-1.8,93.876,-40.0,0.683,5008.7,no
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
37140,67,True,single,unknown,no,yes,no,cellular,aug,wed,...,3,4,2,success,-2.9,92.201,-31.4,0.884,5076.2,no
38274,67,True,single,unknown,no,no,yes,cellular,oct,tue,...,1,2,2,success,-3.4,92.431,-26.9,0.742,5017.5,yes
37539,67,True,single,basic.9y,no,yes,no,cellular,aug,fri,...,2,999,2,failure,-2.9,92.201,-31.4,0.869,5076.2,no
37558,67,True,single,basic.9y,no,yes,no,cellular,aug,fri,...,3,4,2,success,-2.9,92.201,-31.4,0.869,5076.2,no
37579,67,True,single,basic.9y,no,unknown,unknown,cellular,aug,fri,...,2,999,1,failure,-2.9,92.201,-31.4,0.869,5076.2,yes

In [77]:
df.sort_values(by=df.columns.tolist(),ascending=True)

,age,job,marital,education,default,housing,loan,contact,month,day_of_week,...,campaign,pdays,previous,poutcome,emp.var.rate,cons.price.idx,cons.conf.idx,euribor3m,nr.employed,y
37579,67,True,single,basic.9y,no,unknown,unknown,cellular,aug,fri,...,2,999,1,failure,-2.9,92.201,-31.4,0.869,5076.2,yes
37558,67,True,single,basic.9y,no,yes,no,cellular,aug,fri,...,3,4,2,success,-2.9,92.201,-31.4,0.869,5076.2,no
37539,67,True,single,basic.9y,no,yes,no,cellular,aug,fri,...,2,999,2,failure,-2.9,92.201,-31.4,0.869,5076.2,no
38274,67,True,single,unknown,no,no,yes,cellular,oct,tue,...,1,2,2,success,-3.4,92.431,-26.9,0.742,5017.5,yes
37140,67,True,single,unknown,no,yes,no,cellular,aug,wed,...,3,4,2,success,-2.9,92.201,-31.4,0.884,5076.2,no
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
39655,142,True,married,unknown,no,yes,no,cellular,may,thu,...,1,6,2,success,-1.8,93.876,-40.0,0.683,5008.7,no
38921,144,True,married,basic.9y,no,no,no,cellular,nov,wed,...,1,999,1,failure,-3.4,92.649,-30.1,0.716,5017.5,no
27826,145,True,divorced,basic.6y,no,no,no,cellular,mar,thu,...,1,999,0,nonexistent,-1.8,92.843,-50.0,1.650,5099.1,no
38455,148,True,married,basic.4y,unknown,yes,no,cellular,oct,fri,...,2,999,0,nonexistent,-3.4,92.431,-26.9,0.730,5017.5,yes
38452,148,True,married,basic.4y,unknown,yes,no,cellular,oct,fri,...,1,2,2,success,-3.4,92.431,-26.9,0.730,5017.5,yes

In [78]:
df.drop_duplicates(subset=['marital'])

,age,job,marital,education,default,housing,loan,contact,month,day_of_week,...,campaign,pdays,previous,poutcome,emp.var.rate,cons.price.idx,cons.conf.idx,euribor3m,nr.employed,y
0,106,True,married,basic.4y,no,no,no,telephone,may,mon,...,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no
8,74,True,single,professional.course,no,yes,no,telephone,may,mon,...,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no
13,107,True,divorced,basic.4y,no,yes,no,telephone,may,mon,...,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no
40,108,True,unknown,university.degree,no,yes,no,telephone,may,mon,...,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no

In [83]:
df.loc[[0,2],['age','job']]

   age   job
0  106  True
2   87  True

In [92]:
df.loc[1:5,['age','job']]

   age   job
1  107  True
2   87  True
3   90  True
4  106  True
5   95  True

In [1]:
a = 'Mayur Gohane'
for i in a:
    print(i,end='')

Mayur Gohane

In [3]:
a = 'This is orange juice'
if 'orange' in a:
    print('yes')
else:
    print('no')

yes

In [4]:
a = 'A/B Testing and Versioning: Implement model versioning and A/B testing to compare different models in production and ensure the best performing model is live at any given time.'
v = 'auiouAEIOU'
vowels = []
consonants = []
digit = []
space = []
for i in a:
    if i in v:
        vowels.append(i)
    if i.isdigit():
        digit.append(i)
    if i.isspace():
        space.append(i)
    else:
        consonants.append(i)
print(vowels)
print(consonants)
print(digit)
print(space)

['A', 'i', 'a', 'i', 'o', 'i', 'I', 'o', 'i', 'o', 'i', 'a', 'A', 'i', 'o', 'o', 'a', 'i', 'o', 'i', 'o', 'u', 'i', 'o', 'a', 'u', 'o', 'i', 'o', 'i', 'i', 'a', 'a', 'i', 'i']
['A', '/', 'B', 'T', 'e', 's', 't', 'i', 'n', 'g', 'a', 'n', 'd', 'V', 'e', 'r', 's', 'i', 'o', 'n', 'i', 'n', 'g', ':', 'I', 'm', 'p', 'l', 'e', 'm', 'e', 'n', 't', 'm', 'o', 'd', 'e', 'l', 'v', 'e', 'r', 's', 'i', 'o', 'n', 'i', 'n', 'g', 'a', 'n', 'd', 'A', '/', 'B', 't', 'e', 's', 't', 'i', 'n', 'g', 't', 'o', 'c', 'o', 'm', 'p', 'a', 'r', 'e', 'd', 'i', 'f', 'f', 'e', 'r', 'e', 'n', 't', 'm', 'o', 'd', 'e', 'l', 's', 'i', 'n', 'p', 'r', 'o', 'd', 'u', 'c', 't', 'i', 'o', 'n', 'a', 'n', 'd', 'e', 'n', 's', 'u', 'r', 'e', 't', 'h', 'e', 'b', 'e', 's', 't', 'p', 'e', 'r', 'f', 'o', 'r', 'm', 'i', 'n', 'g', 'm', 'o', 'd', 'e', 'l', 'i', 's', 'l', 'i', 'v', 'e', 'a', 't', 'a', 'n', 'y', 'g', 'i', 'v', 'e', 'n', 't', 'i', 'm', 'e', '.']
[]
[' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ']

In [5]:
up = 0
lo = 0
for i in a:
    if i.isupper():
        up += 1
    if i.islower():
        lo += 1
print(up)
print(lo)

7
138

In [6]:
a = 'Hello, have a good day'
b = ''
vowels = 'aeiouAEIOU'
for i in a:
    if i in vowels:
        b += i
print(b)

eoaeaooa

In [7]:
def remove(s,n):
    f = s[:n]
    s = s[n+1]
    return f+s

In [8]:
def remove(string,n):
    f = string[:n]
    s = string[n+1:]
    return f+s

In [12]:
#chnage first & last char of string 
a = 'Hello, have a good day'
b = a.split()
c = [b[-1]] + b[1:-1] + [b[0]]
d = ' '.join(c)
d

'day have a good Hello,'

In [13]:
from collections import Counter
a = 'Hello, have a good day'
b = a.split()
c = dict(Counter(b))
c

{'Hello,': 1, 'have': 1, 'a': 1, 'good': 1, 'day': 1}

In [14]:
a = 'Hello, have a good day'
b = a.count('o')
b

3

In [15]:
#last 2 char
a = 'Hello, have a good day'
b = a.split()
b[-2:]

['good', 'day']

In [17]:
a = "HEllo World Example"
up = 0
for i in a[:4]:
    if i.isupper():
        up += 1
    if up>=2:
        a=a.upper()
print(a)

HELLO WORLD EXAMPLE

In [18]:
#first repated char in string 
a = "HEllo World Example"
b = []
for i in a:
    if i in b:
        print('1 repeated char is',i)
        break
    else:
        b.append(i)
else:
    print('Not')

1 repeated char is l

In [21]:
#second most repeated char in string 
from collections import Counter 
a = "Artificial intelligence (AI) is intelligence demonstrated by machines, in contrast to the natural intelligence displayed by animals including humans"
b = a.split()
c = Counter(b).most_common()
c[1][0]

'by'

In [23]:
a = [1,2,3,4,5]
o = 0
e = 0
for i in a:
    if i%2==0:
        e += 1
    else:
        o += 1
print(o)
print(e)

3
2

In [25]:
a = 'Mayur Gohane'
b = ''
for i,v in enumerate(a):
    if i%2==0:
        b += v
print(b)

MyrGhn

In [26]:
#reverse if length multiple of 5
def reverse(s):
    if len(s)%5==0:
        return s[::-1]
    else:
        return s

In [27]:
reverse('mayur')

'ruyam'

In [32]:
a = 0.05
b = f"{a:.1%}"
b

'5.0%'

In [35]:
a = "Artificial intelligence (AI) is intelligence demonstrated by machines, in contrast to the natural intelligence displayed by animals including humans"
b = a.split()
b.reverse()
print(' '.join(b))

humans including animals by displayed intelligence natural the to contrast in machines, by demonstrated intelligence is (AI) intelligence Artificial

In [39]:
a = "Artificial intelligence (AI) is intelligence demonstrated by machines, in contrast to the natural intelligence displayed by animals including humans"
b = ''
for i in a:
    if i not in b:
        b += i 
print(b)

Artifcal neg(I)sdmobyh,up

In [ ]:
import math 
Area = math.pi*r**2

In [40]:
#sum of square of first n natural numbers 
n = 5
b = 0
for i in range(1,n+1):
    b = b + (i*i)
print(b)

55

In [41]:
#sum of cube of first n natural numbers 
n = 5
b = 0
for i in range(1,n+1):
    b = b + (i*i*i)
print(b)

225

In [43]:
#check prime number 
def prime(n):
    if n<2:
        return False
    for i in range(2,n):
        if n%i==0:
            return False
    return True

In [ ]:
# Assignment 2

In [44]:
a = [5, 25, 30, 45, 78, 99]
max(a)

99

In [45]:
a = [5, 25, 30, 45, 78, 99]
temp=a[0]
a[0]=a[1]
a[1]=temp
a

[25, 5, 30, 45, 78, 99]

In [47]:
a = [25, 5, 30, 45, 78, 99]
a.reverse()
a

[99, 78, 45, 30, 5, 25]

In [49]:
a = [25, 5, 30, 45, 78, 99]
b = {}
for i in a:
    if i in b:
        b[i]+= 1
    else:
        b[i]=1

In [51]:
a = [25, 5, 30, 45, 78, 99]
b = [i*i for i in a]
b

[625, 25, 900, 2025, 6084, 9801]

In [52]:
a = [25, 5, 30, 45, 78, 99]
len(a)

6

In [58]:
n = [222, 25, 5, 30, 45, 78, 99]
small = n[0]
large = n[0]
for i in n:
    if i< small:
        small=i
    if i > large:
        large=i
print(small)
print(large)

5
222

In [59]:
a = input('Enter')
b = [int(i) for i in a.split()]
c = input('Enter')
d = [int(i) for i in c.split()]
for i in d:
    if i in b:
        b.remove(i)
print(b)
print(d)

Enter 1 2 3 4 5
Enter 1 2

[3, 4, 5]
[1, 2]

In [60]:
a = [1, 2, 5, 1.5, 8.8, 'Mayur', 'Gohane']
ing = []
flt = []
stg = []
for i in a:
    if isinstance(i,int):
        ing.append(i)
    if isinstance(i,str):
        stg.append(i)
    if isinstance(i,float):
        flt.append(i)
print(ing)
print(flt)
print(stg)

[1, 2, 5]
[1.5, 8.8]
['Mayur', 'Gohane']

In [61]:
a = [1,2,3]
a.append([88])
a

[1, 2, 3, [88]]

In [62]:
a = [1,2,3]
a.extend([88])
a

[1, 2, 3, 88]

In [63]:
a = [1, 2, 3, 88]
sorted(a)
a[2]

3

In [64]:
from collections import Counter 
a = [2, 2, 55, 66, 55, 78]
b = dict(Counter(a))
b

{2: 2, 55: 2, 66: 1, 78: 1}

In [65]:
#check list contain sublist or not 
a = [2, 5, 7, 8, 9, 10]
b = [2, 5, 8]
f = False
for i in range(len(a)-len(b)+1):
    if a[i:i + len(b)]==b:
        f = True
        break
print(f)

False

In [67]:
#generate sublist of list 
a = [2, 5]
b = []
for i in range(len(a)):
    for j in range(i+1, len(a)+1):
        b.append(a[i:j])
b

[[2], [2, 5], [5]]

In [69]:
a = [2, 5, 8, 9]
b = [2, 5, 8, 10]
c = []
for i in a:
    if i in b:
        c.append(i)
c

[2, 5, 8]

In [70]:
a = [[2, 5], [7, 8], [10, 78, 99]]
b = []
for i in a:
    if isinstance(i,list):
        b.extend(i)
b

[2, 5, 7, 8, 10, 78, 99]

In [71]:
a = [[2, 5], [7, 8], [10, 78, 99]]
b = []
for i in a:
    if isinstance(i,list):
        b.append(i)
b

[[2, 5], [7, 8], [10, 78, 99]]

In [72]:
a = [8, 25, 5, 80]
b = []
while a:
    small= min(a)
    b.append(small)
    a.remove(small)
print(b)

[5, 8, 25, 80]

In [73]:
a = [8, 25, 5, 80]
b = []
while a:
    maxx= max(a)
    b.append(maxx)
    a.remove(maxx)
print(b)

[80, 25, 8, 5]

In [75]:
a = (5, 80, 90, 60, 25)
sorted(a,reverse=True)

[90, 80, 60, 25, 5]

In [77]:
#list to integer to singel integer
a = [11, 33, 50]
b = int(''.join(map(str,a)))
b

113350

In [80]:
a = [8, 25, 5, 80]
a.remove(8)
a

[25, 5, 80]

In [82]:
a = [8, 25, 5, 80]
a.pop(0)
a

[25, 5, 80]

In [84]:
a = [8, 25, 5, 80]
a.sort()
a

[5, 8, 25, 80]

In [85]:
a = [8, 25, 5, 80]
b = sorted(a)
b

[5, 8, 25, 80]

In [86]:
a = [8, 25, 5, 80]
a.reverse()
a

[80, 5, 25, 8]

In [88]:
a = [8, 25, 5, 80]
b = list(reversed(a))
b

[80, 5, 25, 8]

In [89]:
a = [8, 25, 5, 80]
if not a:
    print('e')
else:
    print('no')

no

In [90]:
from collections import Counter 
a = [10, 20, 30, 50]
b = dict(Counter(a))
b

{10: 1, 20: 1, 30: 1, 50: 1}